package oboerukoto;
// 예약어
public class note1 {
// 예약어
	public static void main(String[] args) {

	
		/*예약어들은 변수명으로 쓸 수 없다.
		 * git : 형상 관리툴
		 * 
		 * 원시형
		 * booling 논리 boolean t = false;
		 * char 문자   char c = '안'; (한글자저장가능)
		 * byte 쇼트보다 작음 (1바이트, 8비트)
		 * short 인트보다 작음 (2바이트, 16비트)
		 * int 정수만 저장 할 수 있다. (4바이트, 32비트) 첫번째1은 부호라 빼는거라, 231-1
		 * long 인트보다 많다 (8바이트, 64비트) -참고로 기본숫자는int기때문에 끝에L을써야 큰숫자사용함.
		 * =====================
		 * float 더블보다 작은실수. -참고로 기본실수는double로 인식하기때문에 끝에F를 써야 사용가능함.
		 * double은 실수를 저장 할 수 있다.
		 * 참조형
		 * Random, 
		 * String 문자열 " " 를사용하면 스트링으로인식 
		 * 
		 * 
		 * 
		 * =============
		 * 
		 *'/'나누기  31/10 = 3
		 *'%'나머지  31%10 = 1
		 *
		 * [[[증감하기 (순서대로)]]]
		 * 
		 * int i =1;
		 * i= i+1; 2
		 * i += 1; 3
		 * i++; 4
		 * 
		 * ++i; 5  (1을더해서 출력한다는뜻 선순위)
		 * i++; 5  (다음에 1을더한다는뜻 후순위)
		 * i; 6
		 * 
		 * i**  i%% 이런거는없다.
		 * 
		 * 
		 * 
		 * 쿼리박스
		 * 
		 * --파일 =구조   엑셀파일의 엑셀, 한글파일의 한글
--구조를 만드는것 ddㅣ
--create table  구조를 만들다


no number(5,5),
--no라는 메뉴에 숫자만 넣을거야
--괄호를 안써주면 기본(10,0)으로 읽힘(999999999)
--(5,5)는 (99999.99999)
--(정수.소수점)
erd하는이유 데이터의관계를 쉽게 보이게 하고싶어서.

name varchar(200)
--name이라는 메뉴에 문자만 넣을거야.

--오라클데이터베이스
		 * 
		 */
	
	}
}
